# DelName

## Description
Procedure DelName deletes an object name from a VectorWorks document. The associated object is not affected by the name deletion.

```pascal
PROCEDURE DelName(name : STRING);
```

```python
def vs.DelName(name):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Object name to be deleted.|

## Version
Availability: from All Versions

## Category
* Object Names